In [8]:
import pandas as pd

In [9]:
data = {
    "name": [
        "Alice", "Bob", "Charlie", "Diana", "Ethan",
        "Fiona", "George", "Hannah", "Ian", "Jasmine",
        "Kevin", "Laura", "Mike", "Nina", "Oscar",
        "Paula", "Quinn", "Rachel", "Sam", "Tina"
    ],
    "city": [
        "New York", "Los Angeles", "Chicago", "Houston", "Phoenix",
        "Philadelphia", "San Antonio", "San Diego", "Dallas", "San Jose",
        "Austin", "Jacksonville", "Fort Worth", "Columbus", "Charlotte",
        "San Francisco", "Indianapolis", "Seattle", "Denver", "Boston"
    ],
    "department": [
        "HR", "Finance", "IT", "Marketing", "Sales",
        "IT", "Finance", "HR", "IT", "Marketing",
        "Sales", "Finance", "IT", "HR", "Marketing",
        "IT", "Sales", "Finance", "HR", "IT"
    ],
    "salary": [
        55000, 62000, 75000, 58000, 61000,
        72000, 64000, 56000, 78000, 60000,
        63000, 59000, 81000, 54000, 61000,
        90000, 65000, 70000, 56000, 85000
    ]
}

In [10]:
df = pd.DataFrame(data)
df

       name           city department  salary
0     Alice       New York         HR   55000
1       Bob    Los Angeles    Finance   62000
2   Charlie        Chicago         IT   75000
3     Diana        Houston  Marketing   58000
4     Ethan        Phoenix      Sales   61000
5     Fiona   Philadelphia         IT   72000
6    George    San Antonio    Finance   64000
7    Hannah      San Diego         HR   56000
8       Ian         Dallas         IT   78000
9   Jasmine       San Jose  Marketing   60000
10    Kevin         Austin      Sales   63000
11    Laura   Jacksonville    Finance   59000
12     Mike     Fort Worth         IT   81000
13     Nina       Columbus         HR   54000
14    Oscar      Charlotte  Marketing   61000
15    Paula  San Francisco         IT   90000
16    Quinn   Indianapolis      Sales   65000
17   Rachel        Seattle    Finance   70000
18      Sam         Denver         HR   56000
19     Tina         Boston         IT   85000

In [13]:
df.loc[df['city'].str.contains("San",case=False)]

       name           city department  salary
6    George    San Antonio    Finance   64000
7    Hannah      San Diego         HR   56000
9   Jasmine       San Jose  Marketing   60000
15    Paula  San Francisco         IT   90000

In [18]:
# Start with los
df.loc[df['city'].str.contains(r"^Los",case=False)]

  name         city department  salary
1  Bob  Los Angeles    Finance   62000

In [19]:
# end with 
df.loc[df['city'].str.contains(r'go$',case=False)]

      name       city department  salary
2  Charlie    Chicago         IT   75000
7   Hannah  San Diego         HR   56000

In [20]:
# name start with a vowel
df.loc[df['name'].str.contains(r"^[AEIOU]",case=False)]

     name       city department  salary
0   Alice   New York         HR   55000
4   Ethan    Phoenix      Sales   61000
8     Ian     Dallas         IT   78000
14  Oscar  Charlotte  Marketing   61000

In [23]:
df.loc[df['city'].str.contains(r'New|Los',case=False)]

    name         city department  salary
0  Alice     New York         HR   55000
1    Bob  Los Angeles    Finance   62000